Tekla.Structures.Datatype.Enum`1
The Enum datatype generic.
The enum to handle.

Tekla.Structures.Datatype.Enum`1.Value
Gets or sets the value.

Tekla.Structures.Datatype.Enum`1.GetSchema


Tekla.Structures.Datatype.Enum`1.ReadXml(System.Xml.XmlReader)


Tekla.Structures.Datatype.Enum`1.WriteXml(System.Xml.XmlWriter)
